src/DataProcessors/Обслуживание_ФР_Штрих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>Обслуживание_ФР_Штрих</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТО</Name>
					<Comment>Текущий объект торгового оборудования</Comment>
					<Type>
						<v8:Type>cfg:CatalogObject.ТорговоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PortNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BaudRate</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MachineName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Timeout</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Password</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагОбщийПароль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатьШапкиФД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаШапкиФД</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагПечатьПД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолвоСтрокНаЛист</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СимволовВСтроке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтступСверху</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеФискальныйРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Comment>полностью, кратко в наименовании</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоступа</Name>
					<Comment>Код ручного доступа сотрудника к системе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бригадир</Name>
					<Comment>является бригадиром</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Comment>для идентификации сотрудника как клиента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПланЗала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеМеню</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бригада</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БригадыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курьер</Name>
					<Comment>является курьером доставки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пейджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветОповещенияГотовности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботыСотрудника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УР_Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставБригады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПраваДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МестоРеализации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестаРеализации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборПрав</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаборыПравДоступа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/Обслуживание_ФР_Штрих/Forms/Форма/module.bsl
Перем ТаблицаЗадания;

Процедура ПоказатьПараметрыТаблицы(Таб,Стр)
	
	ИндексСтроки = 1;
	Для Каждого СтрокаШапки ИЗ Таб Цикл
		Если СтрокаШапки.ТипДанных="Строка" Тогда
			Стр=Стр+?(ИндексСтроки=1,"",Символы.ПС)+СтрокаШапки.Данные;
		КонецЕсли;
		ИндексСтроки = ИндексСтроки+1;	
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(ОписаниеПрофиля) ТОгда
		Предупреждение("Данная обработка открывается только из справочника торгового оборудования!",5);
		Отказ = Истина;
		Возврат;  		
	КонецЕсли;   
	
	// заполнение списка COM портов
	Для н=1 По 32 Цикл
		ЭлементыФормы.PortNumber.СписокВыбора.Добавить(н, "COM"+н);
	КонецЦикла;
	
	// заполнение списка скоростей обмена
	СписокСкоростей = ЭлементыФормы.BaudRate.СписокВыбора;
	СписокСкоростей.Добавить(0 ,"2400");
	СписокСкоростей.Добавить(1 ,"4800");
	СписокСкоростей.Добавить(2 ,"9600");
	СписокСкоростей.Добавить(3 ,"19200");
	СписокСкоростей.Добавить(4 ,"38400");
	СписокСкоростей.Добавить(5 ,"57600");
	СписокСкоростей.Добавить(6 ,"115200");
	
	// заполнение списка символов в строке
	СписокСимволовВСтроке = ЭлементыФормы.СимволовВСтроке.СписокВыбора;
	СписокСимволовВСтроке.Добавить(32);
	СписокСимволовВСтроке.Добавить(36);
	СписокСимволовВСтроке.Добавить(40);
	СписокСимволовВСтроке.Добавить(44);
	СписокСимволовВСтроке.Добавить(48);
	
	// управление закладками
	Страницы = ЭлементыФормы.Панель1.Страницы;
	
	Если СокрП(ТО.КодВида) = "ФР" Тогда
		Страницы.Удалить(Страницы.ПД);
		ПоказатьПараметрыТаблицы(ТаблицаШапкиФД,ШапкаФД);
		// заполнение таблицы кассиров
		Для н=1 По 28 Цикл
			ТаблицаКассиров.Добавить().Кассир = "Кассир "+н;
		КонецЦикла;
		ТаблицаКассиров.Добавить().Кассир = "Админ.";
		ТаблицаКассиров.Добавить().Кассир = "Сис.админ.";
		
		ЭлементыФормы.ШапкаФД.Доступность = ПечатьШапкиФД;
		
	ИначеЕсли СокрП(ТО.КодВида) = "ПРН" Тогда
		Страницы.Удалить(Страницы.СписокКассиров);
		Страницы.Удалить(Страницы.Время);
		Страницы.Удалить(Страницы.ШапкаФД);
		Если НЕ Найти("ШтрихКомбо,Штрих950К",СокрП(ТО.КодМодели)) Тогда
			Страницы.Удалить(Страницы.ПД);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


Процедура СохранитьПараметрыТаблицы(Таб,Стр)
	
	Если Таб.Колонки.Количество() = 0 Тогда
		Таб.Колонки.Добавить("Данные");
		Таб.Колонки.Добавить("ТипДанных");
		Таб.Колонки.Добавить("Параметры");
	Иначе
		Таб.Очистить();
	КонецЕсли;
	
	Для н=1 По СтрЧислоСтрок(Стр) Цикл
		НоваяСтрока = Таб.Добавить();
		НоваяСтрока.Данные		=СтрПолучитьСтроку(Стр,н);
		НоваяСтрока.ТипДанных	="Строка";
		НоваяСтрока.Параметры	="Центр,Переносить,ПереводСтроки";
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

// Сохранение параметров и закрытие формы
//
// Параметры
//  <Параметр1>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  – <Тип.Вид> – <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ОсновныеДействияФормыОК(Кнопка)
	
	СохранитьПараметрыТаблицы(ТаблицаШапкиФД,ШапкаФД);
	ЗаполнитьЗначенияСвойств(ПараметрыТО,ЭтотОбъект);
	
	Закрыть("ОК");
	
КонецПроцедуры

Процедура КнопкаПараметрыККМНажатие(Элемент)
	
	Если НЕ Подключить(Истина, Password) Тогда
		Предупреждение(Результат.Описание + Символы.ПС + Результат.Подробно);
	КонецЕсли;
	
	DRV.ShowProperties();
	
	Отключить();
	
КонецПроцедуры

Процедура КнопкаОбновитьВремяНажатие(Элемент)
	
	Если НЕ Подключить(Истина, Password) Тогда
		Предупреждение(Результат.Описание + Символы.ПС + Результат.Подробно);
		Возврат;
	КонецЕсли;
	
	ЭлементыФормы.тВремяККМ.Заголовок = Формат(Дата(Drv.Date),"ДЛФ=Д")+" "+DRV.TimeStr;
	
	ЭлементыФормы.тВремяСистемы.Заголовок = Формат(ТекущаяДата(), "ДЛФ=ДВ");
	
	Отключить();
	
КонецПроцедуры

Процедура КнопкаСинхронизироватьВремяНажатие(Элемент)
	
	Текст2 = "Подтвердите системные дату, время:"+Символы.ПС+Формат(ТекущаяДата(),"ДЛФ=ДВ");
	Если Вопрос(Текст2,РежимДиалогаВопрос.ОКОтмена) = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Парам = Новый Структура;
	Парам.Вставить("Пароль"					, Password);
	Парам.Вставить("ИгнорироватьОбщийПароль", Истина);
	
	ВыполнитьДействие("СинхронизироватьВремя", Парам);
	Если Результат.Ошибка Тогда
		Предупреждение(Результат.Описание + Символы.ПС + Результат.Подробно);
	КонецЕсли;
	
	КнопкаОбновитьВремяНажатие(Элемент);
	
КонецПроцедуры

Процедура СписокКассиров(Режим)
	
	ПарольСА=0;
	Если НЕ ВвестиЧисло(ПарольСА,"Введите пароль системного администратора") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Подключить(Истина, ПарольСА) Тогда
		Предупреждение(Результат.Описание+Символы.ПС+Результат.Подробно);
		Возврат;
	КонецЕсли;
	
	DRV.TableNumber = 2; // таблица кассиров
	
	ИндексСтроки = 1;
	Для Каждого Кассир Из ТаблицаКассиров Цикл
		DRV.RowNumber = ИндексСтроки;
		DRV.FieldNumber=1; // пароль
		DRV.GetFieldStruct();
		Если Режим="Прочитать" Тогда
			DRV.ReadTable();
			Кассир.Пароль = DRV.ValueOfFieldInteger;
		Иначе
			DRV.ValueOfFieldInteger = ?(ПустаяСтрока(Кассир.Пароль),0,Число(Кассир.Пароль));
			DRV.WriteTable();
		КонецЕсли;
		
		DRV.FieldNumber=2; // реквизиты кассиров
		DRV.GetFieldStruct();
		Если Режим="Прочитать" Тогда
			DRV.ReadTable();
			Сотрудник = Справочники.Сотрудники.НайтиПоНаименованию(DRV.ValueOfFieldString,Истина);
			Кассир.ФИО = Сотрудник;
		Иначе
			DRV.ValueOfFieldString=Кассир.ФИО.Наименование;
			DRV.WriteTable();
		КонецЕсли;
		
		Если Ошибка() Тогда
			Предупреждение(Результат.Описание+Символы.ПС+Результат.Подробно);
			Возврат;
		КонецЕсли;	
		
		ИндексСтроки = ИндексСтроки+1;
	КонецЦикла;
	
КонецПроцедуры

Процедура КнопкаКассирыПрочитатьНажатие(Элемент)
	
	СписокКассиров("Прочитать");	
	Отключить();
	
КонецПроцедуры

Процедура КнопкаКассирыЗагрузитьНажатие(Элемент)
	
	СписокКассиров("Загрузить");
	Отключить();
	
КонецПроцедуры

Процедура КнопкаКассирыОчиститьВсеНажатие(Элемент)
	Для Каждого Кассир Из ТаблицаКассиров  Цикл
		Кассир.ФИО = Неопределено;
		Кассир.Пароль = "";
	КонецЦикла;
КонецПроцедуры

Процедура ТаблицаКассировФИОПриИзменении(Элемент)
	СтрокаТаблицы        = ЭлементыФормы.ТаблицаКассиров.ТекущаяСтрока;
	СтрокаТаблицы.Пароль = СтрокаТаблицы.ФИО.КодДоступа;
КонецПроцедуры

Процедура ПечатьШапкиФДПриИзменении(Элемент)
	
	ЭлементыФормы.ШапкаФД.Доступность = ПечатьШапкиФД;
	
КонецПроцедуры
